-- --------------------------------------------------------
-- 主机:                           192.168.3.234
-- 服务器版本:                        5.5.53 - MySQL Community Server (GPL)
-- 服务器操作系统:                      Win32
-- HeidiSQL 版本:                  9.5.0.5220
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;


-- 导出 dangdang 的数据库结构
CREATE DATABASE IF NOT EXISTS `dangdang` /*!40100 DEFAULT CHARACTER SET utf8 */;
USE `dangdang`;

-- 导出  表 dangdang.goods 结构
CREATE TABLE IF NOT EXISTS `goods` (
  `gid` int(11) NOT NULL AUTO_INCREMENT COMMENT '商品id',
  `goodsname` varchar(900) NOT NULL COMMENT '商品名',
  `price` float NOT NULL DEFAULT '0' COMMENT '价格',
  `imgsrc` varchar(900) NOT NULL DEFAULT '0' COMMENT '图片',
  `keywords` varchar(900) DEFAULT NULL COMMENT '描述',
  `author` varchar(900) NOT NULL DEFAULT '0' COMMENT '作者',
  `pjnumber` int(11) NOT NULL DEFAULT '0' COMMENT '评价量',
  `scnumber` int(11) NOT NULL DEFAULT '0' COMMENT '收藏量',
  PRIMARY KEY (`gid`)
) ENGINE=MyISAM AUTO_INCREMENT=59 DEFAULT CHARSET=utf8;

-- 正在导出表  dangdang.goods 的数据：47 rows
/*!40000 ALTER TABLE `goods` DISABLE KEYS */;
INSERT INTO `goods` (`gid`, `goodsname`, `price`, `imgsrc`, `keywords`, `author`, `pjnumber`, `scnumber`) VALUES
	(1, '习近平谈治国理政', 64, 'http://img3m7.ddimg.cn/56/32/28978247-1_l_4.jpg', ' 习近平谈治国理政（第三卷）（中文平装）100册以上团购请联系团购电话4001066666转6', '习近平', 4, 12312),
	(2, '给孩子的思维导图', 34, 'http://img3m5.ddimg.cn/37/31/28972585-1_l_6.jpg', ' 给孩子的思维导图课：受益一生的阅读力训练 名师深度解析阅读的重点和难点 + 思维导图的技法和画法，让思维看得见，阅读从此成为拿分项', '王玉印 杨泽', 98, 456),
	(3, '父与子', 35.2, 'https://ss2.bdstatic.com/70cFvnSh_Q1YnxGkpoWK1HF6hhy/it/u=2744356553,3447077353&fm=26&gp=0.jpg', ' 作家榜经典：父与子全集(郑渊洁推荐版《父与子》，亲子同读必备！连续3年销量靠前，开创10万+读者五星好评推荐)', '[德] 卜劳恩', 98136340, 3402),
	(4, '祈念守护人', 59, 'http://img3m6.ddimg.cn/33/8/28549356-1_w_15.jpg', '全球同步发售，中日初次联合策划，《解忧杂货店》八年后又一部奇迹小说，日本上市即登顶纪伊国屋畅销总榜。就算世界冷漠疏离，《祈念守护人》为你找回人情温暖！东野圭吾初次寄语中国读者。', '东野圭吾', 9798, 20202),
	(5, '人间失格', 33.1, 'http://img3m5.ddimg.cn/8/9/28974635-1_x_2.jpg', '在182万读者5星好评版本基础上，增补4个名篇18幅照片1篇年谱，全新精装升级，收藏&馈赠俱佳。“生而为人，我很抱歉”，太宰治用十全十美的文字，书写百分之百的孤独.', '太宰治', 283, 778),
	(6, '风声', 37.2, 'http://img3m3.ddimg.cn/22/24/25308283-1_x_2.jpg', '面对残局，身处孤独与绝望之中，如何跳出黑暗的深渊？茅盾文学奖得主麦家代表作，《人民文学》创刊58年首次全文登载的长篇小说，华语文学传媒大奖“年度小说家”获奖。', '麦家', 27143, 925),
	(8, ' 爱的小时刻', 55.6, 'http://img3m8.ddimg.cn/45/25/28972098-2_x_3.jpg', 'Ins人气漫画家卡塔纳倾心绘制 美国豆瓣Goodreads读者选择奖*漫画提名 让情侣们会心一笑的恋爱甜段子 画师本人?男友约翰日常撒糖！', '[美]卡塔纳˙切特温德 ', 1, 0),
	(9, '像火烈鸟一样，活出自己', 26.9, 'http://img3m6.ddimg.cn/29/32/28982576-1_x_3.jpg', '火烈鸟是群体中一个不一样的存在 粉红色的艳丽外表 笔直的大长腿 走到哪里都能吸引无数眼光 它们不在意别人的评论 只想活成自己期望的样子 与火烈鸟相处 学习如何做你自己吧', '[英］萨拉·福特', 0, 0),
	(10, '老人与海', 32.8, 'http://img3m3.ddimg.cn/25/3/24183943-1_x_85.jpg', '连续2年包揽当当名著《老人与海》销量桂冠！创下188484名读者真实5星好评！靠口碑横扫各大畅销榜单，被誉为“海明威在当代汉语中成功转世”！入选上海国际学校德威指定版本！认准作家榜，谨防山寨仿冒！', '[美] 海明威', 189495, 6037),
	(11, '城南旧事', 8.9, 'http://img3m9.ddimg.cn/48/18/22800639-1_x_12.jpg', '城南旧事（中小学新课标必读名著）380000多名读者热评！', '林海音', 400419, 15408),
	(12, '做自己就很好', 33, 'http://img3m8.ddimg.cn/65/20/28543448-1_x_3.jpg', 'Instagram超人气艺术家Ton Mak携治愈树懒来袭，2019年青年图书馆协会选书，亚马逊4.8颗星好评推荐。', '[英]Ton Mak ', 4, 0),
	(13, '地球上线', 45, 'http://img3m7.ddimg.cn/6/29/28541607-1_x_3.jpg', '随书附赠唐陌的异能书！152亿积分，41万收藏，高人气作者莫晨欢代表作，年度末世无限流小说口碑爆品！神秘黑塔降临地球，上亿玩家被拉入攻塔游戏。', '莫晨欢', 1401, 0),
	(14, '母亲大人', 39.8, 'http://img3m2.ddimg.cn/51/29/28546602-1_x_7.jpg', '暖心剧集《再见啦！母亲大人》同名漫画，80后记忆中温馨有趣的母子日常。', '柿子炒蛋', 0, 3),
	(15, '白色橄榄树', 66.9, 'http://img3m0.ddimg.cn/22/1/27850900-1_x_11.jpg', '那天，他透过窗子往外看，看见空旷的原野上，有一棵白色橄榄树。全文修订&随书附含独家后记+8P“定情之地”浪漫彩插+“来自阿瓒的问候”深情贺卡！白马时光）', '玖月晞', 25505, 1202),
	(16, ' 撒野3完结篇', 45.5, 'http://img3m2.ddimg.cn/90/14/28541592-1_x_9.jpg', '撒野系列终篇，晋江年度十大高人气原创文学之一，畅销书作者巫哲代表作。', '巫哲', 17018, 0),
	(17, '万花筒千里', 39.8, 'http://img3m7.ddimg.cn/20/24/27924257-1_x_10.jpg', '万花筒千里 西子绪著 死亡万花筒实体书系列第三3部 悬疑推理恐怖小说 死亡万花筒超话 秋石男烛 万花筒全套系列（千寻文化）', '西子绪', 4256, 180),
	(18, '保持饥渴', 42.9, 'http://img3m2.ddimg.cn/20/2/27928712-1_x_8.jpg', '吴晓波频道、樊登、张瑞敏、十点读书、新华每日电讯力荐畅销书！乔布斯、马云、陈一舟等大咖倡导，助你在不确定时代，始终保持饥渴状态，有“饿狼精神”，培养超强的战斗力、敏锐的嗅觉，闻到味道敢上，见到肉敢吃。', '[英] Thinkers50', 5621, 235),
	(20, '东野圭吾：祈念守护', 59.5, 'http://img3m6.ddimg.cn/33/8/28549356-1_l_15.jpg', '全球同步发售，中日初次联合策划，《解忧杂货店》八年后又一部奇迹小说，日本上市即登顶纪伊国屋畅销总榜。就算世界冷漠疏离，《祈念守护人》为你找回人情温暖！东野圭吾初次寄语中国读者。', '东野圭吾', 10321, 32551),
	(21, '超级生物', 16.8, '0http://img3m4.ddimg.cn/63/14/1901221704-1_l_1.jpg', '“惊人院”在全媒体平台拥有着极为庞大的粉丝量，《超级生物》作为惊人院出版的*部长篇小说，备受读者期待！ ', '金子息', 21, 35),
	(22, '厉害了！王阳明', 36.01, 'http://img3m3.ddimg.cn/67/25/28558993-1_l_3.jpg', '王阳明研究会会长为您逐年逐事、彻彻底底、清清楚楚讲透王阳明57年人生！', '王程强', 2034, 1514),
	(23, '童年', 23.9, 'http://img3m2.ddimg.cn/31/24/25126132-1_x_1.jpg', '《童年》被《纽约时报》和美国《读者文摘》组织的横跨欧、亚、美、澳、非五大洲百城十万读者的投票调查，精选为十部经典长篇名著之一!', '高尔基', 1541, 668),
	(24, '神奇校车', 142.5, 'http://img3m0.ddimg.cn/61/3/23444350-1_x_4.jpg', '美国Scholastic学子出版社金牌畅销系列，继续打造神奇校车的科学冒险之旅！全新内容，全新体验，小神校迷不可错过的独立阅读读本！', '乔安娜柯尔', 995151, 75122),
	(25, '夏洛的网', 25.5, 'http://img3m6.ddimg.cn/7/21/23546266-1_x_9.jpg', '三年级必读经典书目，“美国*伟大的十部儿童文学名著”之首，全球行销千万册，关于爱、友谊、生死，一本读到流泪的“真正的书”儿童文学', '怀特', 584552, 65245),
	(26, '你当像鸟飞往你的山', 59.9, 'http://img3m2.ddimg.cn/0/27/28473192-1_x_3.jpg', '17岁前从未上过学的女孩，如何成为剑桥大学博士？我们要背叛多少曾经，才能找到真正的自我！《纽约时报》 等数十家媒体一致公推“年度图书”，作者获选《时代周刊》年度影响力人物！这本书比你听说的还要好！', '塔拉 · 韦斯特弗', 215, 47),
	(27, '断舍离', 25.9, 'http://img3m3.ddimg.cn/68/20/23271503-2_x_12.jpg', '经典断舍离！山下英子初版全本，未经任何删节！2013年7月引进内地，简体中文版系列累计销量突破200万册！张德芬作序，杨澜、林依晨认可推荐！《人民日报》《新京报》《新周刊》等纷纷报道。', '山下英子', 335234, 52152),
	(54, '呃呃呃抖动的', 7, '额威威', '酷酷酷', '茹入', 8, 9),
	(29, '活着', 26.9, 'http://img3m0.ddimg.cn/7/27/25137790-1_x_4.jpg', '余华是我国当代著名作家，也是享誉世界的小说家，曾荣获众多国内外奖项。《活着》是其代表作，在全球广泛传播，销量逾千万册，获得了普遍好评，已成为中国乃至世界当代文学的经典。', '余华', 154255, 59221),
	(30, '霍乱时期的爱情', 69.9, 'http://img3m0.ddimg.cn/59/31/28522850-1_x_4.jpg', '《百年孤独》作者马尔克斯传世名著，深刻影响莫言、余华的写作生涯，写尽人类爱情所有可能：一个人能为爱等多久？答案是五十一年九个月零四天。中文版畅销300万册，一本好书节目推荐', '加西亚 · 马尔克斯', 37, 0),
	(31, '稻草人', 17.6, 'http://img3m9.ddimg.cn/57/20/26315049-1_x_5.jpg', '中国童话开创人、中国现代童话创作的拓荒者、“优秀的语言家”叶圣陶经典作品！新中国首部为儿童而写的童话集，鲁迅评价：“叶圣陶的《稻草人》是给中国的童话开了一条自己创作的路。”舒朗排版，大字护眼，阅读不累', '叶圣陶，张荣梅', 1524, 425),
	(32, '追风筝的人', 33.4, 'http://img3m5.ddimg.cn/26/14/25238195-1_x_3.jpg', '为你，千千万万遍！快乐大本营高圆圆感动推荐，朗读者张一山深情诵读，窦靖童创作灵感的来源，奥巴马送给女儿的新年礼物', '卡勒德·胡赛尼', 542558, 35214),
	(33, '坏小孩', 32.4, 'http://img3m2.ddimg.cn/97/25/25301032-1_x_6.jpg', '“推理之王”紫金陈代表作，秦昊王景春领衔主演，爱奇艺迷雾剧场《隐秘的角落》原著小说。因为预售过于火爆，请各位耐心等待，我们会尽快送货。', '紫金陈', 3515, 301),
	(34, '皮囊', 24.9, 'http://img3m1.ddimg.cn/3/6/27872661-1_x_13.jpg', '刘德华、韩寒、白岩松感动推荐。2019全新升级，书封采用具有肌肤质感的SKINS纸。命运是一条闪闪发光的金色河流，我们彼此相遇，卸下皮囊，以心相交。果麦出品', '蔡崇达，果麦文化', 5214, 3631),
	(35, '爱的教育', 15.99, 'http://img3m7.ddimg.cn/57/15/23643237-1_x_4.jpg', '非改写&非编译，“偷看”他人日记，窥得童年秘密。朴实文字抒发爱的道理，世界公认的富有爱心和教育性的读物', '亚米契斯', 52156, 9652),
	(38, '海底两万里', 19.99, 'http://img3m8.ddimg.cn/37/30/25126138-1_x_3.jpg', '豆瓣8.4分译本。非改写&非编译。快跟上鹦鹉螺号，海底探险之旅出发！', '儒勒·凡尔纳', 5244, 4200),
	(53, '搜搜书', 74, '急急急', '帆帆帆帆', '呃呃呃', 78, 89),
	(40, '福尔摩斯探案集', 13.4, 'http://img3m4.ddimg.cn/81/18/23453874-1_x_4.jpg', '23位著名语文教研员联袂推荐 智慧熊联合商务印书馆 童趣倾力打造 新老版本任意发货', '柯南 道尔', 54856, 5845),
	(42, '天才在左 疯子在右', 45.6, 'http://img3m2.ddimg.cn/96/32/25285092-1_x_4.jpg', '上市以来持续霸榜，累计销量破500万册！高圆圆、陈乔恩、李宇春、胡歌、刘昊然盛情推荐！女神、男神都在看的传奇畅销书！借疯子的策略，唤醒你未知的灵魂！看高智商疯子如何调戏和“羞辱”正常人！ ', '高铭', 35424, 20125),
	(43, '胡桃夹子', 17.8, 'http://img3m0.ddimg.cn/22/25/28495390-1_x_3.jpg', '本套系列丛书精选了获纽伯瑞儿童文学奖精心编译部部经典，生动精彩的美绘插画让你获得文学、视觉与心灵的多重享受！带给你与众不同的阅读体验！', 'E.T.A.霍夫曼', 35164, 5551),
	(44, '昆虫记', 33.6, 'http://img3m7.ddimg.cn/36/29/25126137-1_x_1.jpg', '2018修订版全新上市！应读者需求，新增文前高清彩色照片图，订正内文表述更精准！', '亨利·法布尔', 63525, 3254),
	(45, '汤姆·索亚历险记', 18, 'http://img3m6.ddimg.cn/33/6/25061586-1_x_4.jpg', '马克·吐温作品权威翻译家张友松译本。清华附小校长、语文特级教师窦桂梅推荐的儿童冒险经典，非改写&非编译，语言活泼，童趣十足', '马克·吐温', 6541, 2542),
	(46, '狼王梦', 20.8, 'http://img3m9.ddimg.cn/84/5/25309929-1_x_13.jpg', '出版10周年荣誉纪念,全系列36册尽揽所有，重装改版，全面升级，其中多篇被选入各地中小学教材，获奖无数，至臻精品，一生典藏！', '沈石溪', 4251, 1803),
	(47, '我们仨', 28, 'http://img3m4.ddimg.cn/49/19/25284154-1_x_3.jpg', '杨绛以简洁而沉重的语言，回忆先她而去的女儿钱媛、丈夫钱钟书，回忆一家三口那些快乐而艰难、爱与痛的日子。家庭是一生的庇护所，生命的意义不会因为躯体的生灭而有所改变', '杨绛', 85564, 14786),
	(48, '希腊神话故事', 21.4, 'http://img3m5.ddimg.cn/31/28/24229885-1_x_3.jpg', '注音&详细注释&非改写&非编译，讲述奥林匹斯诸神、特洛伊战争的传说，郑振铎说：“不懂得希腊神话，简直没法了解和欣赏西方的文艺。”', '古斯塔夫·施瓦布', 6452, 2621),
	(49, '下雨的书店', 63, 'http://img3m6.ddimg.cn/85/2/26510206-1_x_8.jpg', '光临下雨的书店，每个孩子都能成为想象大师，在书的世界里寻找自己的故事，收获心灵的愉悦，养成读书的好习惯。读者眼中Zui适合拍成宫崎骏动画的儿童幻想小说。2018年“中国童书榜”100佳童书', '日向理惠子', 1245, 356),
	(50, '一九八四', 25.8, 'http://img3m4.ddimg.cn/96/20/25215594-1_x_2.jpg', '豆瓣评分高达9.4；村上春树、王小波极力推荐；一本让你感到紧张、刺激、不安的讽喻小说', '乔治·奥威尔', 32556, 12444),
	(51, '吹牛大王历险记', 16.9, 'http://img3m0.ddimg.cn/10/35/25190560-1_x_2.jpg', '充满欢乐的德国百年童话，奇幻历险中收获勇气与智慧。', '埃·拉斯伯', 2153, 543),
	(52, '人生', 45, 'http://img3m3.ddimg.cn/73/19/28504153-1_x_3.jpg', '茅盾文学奖得主路遥代表作，激励万千读者的文学经典。写出每个年轻人的困境、期待与追求。改变马云人生，陈忠实、贾樟柯推荐', '路遥', 5223, 665);
/*!40000 ALTER TABLE `goods` ENABLE KEYS */;

/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IF(@OLD_FOREIGN_KEY_CHECKS IS NULL, 1, @OLD_FOREIGN_KEY_CHECKS) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
